In [51]:
import numpy as np
import pandas as pd
import os

In [5]:
df=pd.read_excel("stats.xls")

In [6]:
df.head(10)

   Emp#  YearsOfExp  Salary in Rs.
0     1          10         126015
1     2           1          12598
2     3           8         100639
3     4          10         125351
4     5           2          25031
5     6           5          62630
6     7           9         112620
7     8           8         100639
8     9           4          50145
9    10           2          25232

In [7]:
df.describe()

            Emp#  YearsOfExp  Salary in Rs.
count  25.000000   25.000000      25.000000
mean   13.000000    6.200000   77821.200000
std     7.359801    3.175426   39847.615281
min     1.000000    1.000000   12598.000000
25%     7.000000    3.000000   37592.000000
50%    13.000000    7.000000   87654.000000
75%    19.000000    9.000000  113112.000000
max    25.000000   10.000000  126015.000000

In [31]:
Sal_mean=df['Salary in Rs.'].mean(axis=0)

In [10]:
Sal_mode=df['Salary in Rs.'].mode()

In [12]:
Sal_median=df['Salary in Rs.'].median()

In [14]:
Yrs_mean=df['YearsOfExp'].mean()

In [15]:
Yrs_mode=df['YearsOfExp'].mode()

In [16]:
Yrs_median=df['YearsOfExp'].median()

In [28]:
print(" The mean for salary of the employees:{}\n The mode for salary of the employees:{}\n The median for salary of the employees:{}\n".format(Sal_mean,Sal_mode,Sal_median))

 The mean for salary of the employees:77821.2
 The mode for salary of the employees:0    100639
dtype: int64
 The median for salary of the employees:87654.0

In [37]:

print(" The mean for Years of experience of the employees:{}\n The mode for Years of experience of the employees:{}\n The median for Years of experience of the employees:{}\n".format(Yrs_mean,Yrs_mode,Yrs_median))

 The mean for Years of experience of the employees:6.2
 The mode for Years of experience of the employees:0    10
dtype: int64
 The median for Years of experience of the employees:7.0

In [49]:
std=df['Salary in Rs.'].std()
var=df['Salary in Rs.'].var()

In [50]:
print(" The Standard Deviation for salary of the employees:{}\n The Variance for salary of the employees:{}\n".format(std,var))

 The Standard Deviation for salary of the employees:39847.6152810094
 The Variance for salary of the employees:1587832443.5833337